kossnikita/at32f4xx-pac/src/at32f425/at32f425.svd
        <cluster>
          <dim>7</dim>
          <dimIncrement>0x14</dimIncrement>
          <dimIndex>1-7</dimIndex>
          <name>Channel%s</name>
          <description>DMA Channel %s</description>
          <addressOffset>0x8</addressOffset>
          <register>
            <name>CTRL</name>
            <displayName>C1CTRL</displayName>
            <description>DMA channel %s configuration register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CHEN</name>
                <description>Channel enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>CHENR</name>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Channel is disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Channel is enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <name>CHENW</name>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Channel disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Channel enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FDTIEN</name>
                <description>Full data transfer interrupt enable</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>FDTIENR</name>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Transfer complete interrupt is disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Transfer complete interrupt is enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <name>FDTIENW</name>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Transfer complete interrupt disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Transfer complete interrupt enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HDTIEN</name>
                <description>Half data transfer interrupt enable</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>HDTIENR</name>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Half-transfer interrupt is disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Half-transfer interrupt is enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <name>HDTIENW</name>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Half-transfer interrupt disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Half-transfer interrupt enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DTERRIEN</name>
                <description>Data transfer error interrupt enable</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>DTERRIENR</name>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Data transfer error interrupt is disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Data transfer error interrupt is enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <name>DTERRIENW</name>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Data transfer error interrupt disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Data transfer error interrupt enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DTD</name>
                <description>Data transfer direction</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>DTD</name>
                  <usage>read-write</usage>
                  <enumeratedValue>
                    <name>Peripherals</name>
                    <description>Read from peripherals</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Memory</name>
                    <description>Read from memory</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LM</name>
                <description>Loop mode</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>LMR</name>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Circular mode is disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Circular mode is enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <name>LMW</name>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Circular mode disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Circular mode enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PINCM</name>
                <description>Peripheral address increment mode</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>PINCMR</name>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Peripheral address increment is disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Peripheral address increment is enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <name>PINCMW</name>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Peripheral address increment disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Peripheral address increment enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MINCM</name>
                <description>Memory address increment mode</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>MINCMR</name>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Memory address increment is disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Memory address increment is enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <name>MINCMW</name>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Memory address increment disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Memory address increment enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PWIDTH</name>
                <description>Peripheral data bit width</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <name>PWIDTH</name>
                  <usage>read-write</usage>
                  <enumeratedValue>
                    <name>bit8</name>
                    <description>8 bits</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>bit16</name>
                    <description>16 bits</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>bit32</name>
                    <description>32 bits</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MWIDTH</name>
                <description>Memory data bit width</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <name>MWIDTH</name>
                  <usage>read-write</usage>
                  <enumeratedValue>
                    <name>bit8</name>
                    <description>8 bits</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>bit16</name>
                    <description>16 bits</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>bit32</name>
                    <description>32 bits</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHPL</name>
                <description>Channel Priority level</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <name>CHPL</name>
                  <usage>read-write</usage>
                  <enumeratedValue>
                    <name>Low</name>
                    <description>Low</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Medium</name>
                    <description>Medium</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>High</name>
                    <description>High</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VeryHigh</name>
                    <description>VeryHigh</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>M2M</name>
                <description>Memory to memory mode</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <name>M2MR</name>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Memory to memory mode is disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Memory to memory mode is enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <name>M2MW</name>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Memory to memory mode disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Memory to memory mode enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DTCNT</name>
            <displayName>C1DTCNT</displayName>
            <description>DMA channel %s number of data to transfer register</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CNT</name>
                <description>Number of data to transfer</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <writeConstraint>
                  <range>
                    <minimum>0</minimum>
                    <maximum>65535</maximum>
                  </range>
                </writeConstraint>
              </field>
            </fields>
          </register>
          <register>
            <name>PADDR</name>
            <displayName>C1PADDR</displayName>
            <description>DMA channel %s peripheral base address register</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PADDR</name>
                <description>Peripheral address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <writeConstraint>
                  <range>
                    <minimum>0</minimum>
                    <maximum>4294967295</maximum>
                  </range>
                </writeConstraint>
              </field>
            </fields>
          </register>
          <register>
            <name>MADDR</name>
            <displayName>C1MADDR</displayName>
            <description>DMA channel %s memory base address register</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MADDR</name>
                <description>Memory address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <writeConstraint>
                  <range>
                    <minimum>0</minimum>
                    <maximum>4294967295</maximum>
                  </range>
                </writeConstraint>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>DMA_SRC_SEL0</name>
          <displayName>DMA_SRC_SEL0</displayName>
          <description>DMA channel source assignment register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH1_SRC</name>
              <description>CH1 SRC select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CH2_SRC</name>
              <description>CH2 SRC select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CH3_SRC</name>
              <description>CH3 SRC select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CH4_SRC</name>
              <description>CH4 SRC select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_SRC_SEL1</name>
          <displayName>DMA_SRC_SEL1</displayName>
          <description>DMA channel source assignment register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH5_SRC</name>
              <description>CH5 SRC select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CH6_SRC</name>
              <description>CH6 SRC select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CH7_SRC</name>
              <description>CH7 SRC select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DMA_FLEX_EN</name>
              <description>DMA FLEX Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
